app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "email", "gender", "created_at", "updated_at", "dob_day", "dob_month", "dob_year") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "uPi9XKfTLkgipsBDkrFvow"], ["updated_at", "2021-03-17 15:54:52.690381"], ["id", 1]]
---
    def create
        @user = User.create(user_params)
        if @user.save